print(1)
#print(type(name))  функция, которая указывает на тип данных

# \------------------------------------------------------------------------------------
print("TASK 1")
# Чтобы создать строку и сохранить ее в переменную необходимо написать
# следующим образом:
s = "hello" # создание 1-ой строки
w = "world" # создание 2-ой строки
g = 'my friends "good"' # создание 3-ей строки
print(s, w, g)

# \------------------------------------------------------------------------------------
print("TASK 2")
# Интерполяция: — способ получить сложную строку из нескольких простых
# с использованием специальных шаблонов.
a = 3
b = 11
s = 2022
print(a, b, s)
print('{} - {} - {}'.format(a,b,s))
print(f'first - {a} second - {b} third - {s}')

# \------------------------------------------------------------------------------------
print("TASK 3")
# Пример:
print("Введите первое число:")
a = int(input())
print("Введите второе число:")
b = int(input())
print(a, "+", b, "=", a+b)

# \------------------------------------------------------------------------------------
print("TASK 4")
# Округление числа
# Можно указать количество знаков после запятой:
a = 1.43425
b = 2.2983
c = round(a * b, 5) # 3,29634
print(c)

# \------------------------------------------------------------------------------------
print("TASK 5")
# Сравнение в Python
a = 1 > 4
print(a) # False

# \------------------------------------------------------------------------------------
print("TASK 6")
# Цикл While
n = 423
summa = 0
while n > 0:
    x = n % 10
    summa = summa + x
    n = n // 10
print(summa) # 9

# \------------------------------------------------------------------------------------
print("TASK 7")
n = int(input())
flag = True
i = 2

while flag:
    if n % i == 0:
        flag = False
        print(i)
    i += 1

# \------------------------------------------------------------------------------------
print("TASK 8")
# Цикл for, функция range()
r = range(5) # 0 1 2 3 4
r = range(2, 5) # 2 3 4
r = range(-5, 0) # ----
r = range(1, 10, 2) # 1 3 5 7
r = range(100, 0, -20) # 100 80 60 40 20
r = range(100, 0, -20) # range(100, 0, -20)
for i in r:
    print(i)
# 100 80 60 40 20

# \------------------------------------------------------------------------------------
print("TASK 9")
text = 'СъЕШЬ ещё этих МяГкИх французских булок'
print(len(text)) # 39
print('ещё' in text) # True
print(text.lower()) # съешь ещё этих мягких французских булок
print(text.upper()) # СЪЕШЬ ЕЩЁ ЭТИХ МЯГКИХ ФРАНЦУЗСКИХ БУЛОК
print(text.replace('ещё','ЕЩЁ')) # СъЕШЬ ЕЩЁ этих МяГкИх французских булок

# \------------------------------------------------------------------------------------
print("TASK 10")
# Срезы
text = 'съешь ещё этих мягких французских булок'
print(text[0]) # c
print(text[1]) # ъ
print(text[len(text)-1]) # к
print(text[-5]) # б
print(text[:]) # съешь ещё этих мягких французских булок
print(text[:2]) # съ
print(text[len(text)-2:]) # ок
print(text[2:9]) # ешь ещё
print(text[6:-18]) # ещё этих мягких
print(text[0:len(text):6]) # сеикакл
print(text[::6]) # сеикакл
text = text[2:9] + text[-5] + text[:2] # ...

# \------------------------------------------------------------------------------------
print("TASK 11")
# Арифметические операции

# 1. Возведение в степень (**)
# 2. Умножение (*)
# 3. Деление (/)
# 4. Целочисленное деление (//)
# 5. Остаток от деления (%)
# 6. Сложение (+)
# 7. Вычитание (-)
